/*------------------------------------------------------------------------
   版权 2017-2027 中国航空工业集团第六三一所第十八研究室
   
   对本文件的拷贝、发布、修改或者其他任何用途必须得到
   中国航空工业集团第六三一所的书面协议许可
   
   File : edma.h
   
   Description : GPIO驱动的头文件
   
   Revision History :
   rev.0.01 2018-01-02,马振华,创建
------------------------------------------------------------------------*/
#ifndef EDMA_H_
#define EDMA_H_

#ifdef __cplusplus
extern "C" {
#endif

/*------------------------------------------------------------------------
   include files
------------------------------------------------------------------------*/


/*------------------------------------------------------------------------
   macro definition
------------------------------------------------------------------------*/
#define eTPUFuelTst    0

/*------------------------------------------------------------------------
   extern function declaration
------------------------------------------------------------------------*/
/*extern void TCDnInit(uint32_t chan);
extern void EDMAInitTST (void);
extern void delay(int ms);*/


#ifdef __cplusplus
}
#endif

#endif		/* end intc.h*/
