
/*******************************************************************************
 * 版权 2015-2016 中国航空工业集团第六三一所第十八研究室                       
 *                                                                             
 * 对本文件的拷贝、发布、修改或者其他任何用途必须得到中国航空工业集团第六三一所
 * 的书面协议许可。                                                            
 *                                                                             
 * Copyrights (2015-2016) ACTRI                                                
 * All Right Reserved                                                          
 *******************************************************************************
                                                                               
 *******************************************************************************
 * Revision History                                                            
 *------------------------------------------------------------------------------
 * 2017-12-07, gbo, created                                                    
 *******************************************************************************

 *******************************************************************************
 * content                                                                     
 *------------------------------------------------------------------------------
 *  File            : etpu_fuelenable_auto.h                                   
 *  Description     : 喷油特殊信号头文件                                     
 *  Call            : 029-89186510                                             
 *  该文件由ETPU自动生成，请勿修改！！！                                       
 ******************************************************************************/
#ifndef _ETPU_FUEL_ENABLE_AUTO_H_
#define _ETPU_FUEL_ENABLE_AUTO_H_

/* Function Configuration Information */
#define FS_ETPU_FUEL_ENABLE_FUNCTION_NUMBER 7 
#define FS_ETPU_FUEL_ENABLE_TABLE_SELECT 1 
#define FS_ETPU_FUEL_ENABLE_NUM_PARMS 0x0008 

/* Host Service Request Definitions */
/* 喷油使能初始化 */
#define FS_ETPU_FUEL_ENABLE_INIT 7 
#endif /* _ETPU_PWM_AUTO_H_ */

