/*------------------------------------------------------------------------
   版权 2017-2027 中国航空工业集团第六三一所第十八研究室
   
   对本文件的拷贝、发布、修改或者其他任何用途必须得到
   中国航空工业集团第六三一所的书面协议许可
   
   File : PIT.h
   
   Description : 定时中断的头文件
   
   Revision History :
   rev.0.01 2018-01-16,马振华,创建
------------------------------------------------------------------------*/
#ifndef PIT_H_
#define PIT_H_

#ifdef __cplusplus
extern "C" {
#endif

/*------------------------------------------------------------------------
   include files
------------------------------------------------------------------------*/


/*------------------------------------------------------------------------
   macro definition
------------------------------------------------------------------------*/

/*------------------------------------------------------------------------
   extern variables declaration
------------------------------------------------------------------------*/


/*------------------------------------------------------------------------
   extern function declaration
------------------------------------------------------------------------*/
extern  void PIT0_init(void);
extern 	void PIT1_init(void);
extern 	void PIT2_init(void);
extern 	void PIT3_init(void);
extern 	void PIT0_isr(void);
extern 	void PIT1_isr(void);
extern 	void PIT2_isr(void);
extern 	void PIT3_isr(void);

#ifdef __cplusplus
}
#endif

#endif		/* end PIT.h*/
