/*******************************************************************************
 * 版权 2015-2016 中国航空工业集团第六三一所第十八研究室
 *
 * 对本文件的拷贝、发布、修改或者其他任何用途必须得到中国航空工业集团第六三一所
 * 的书面协议许可。
 *
 * Copyrights (2015-2016) ACTRI
 * All Right Reserved
 *******************************************************************************

 *******************************************************************************
 * Revision History
 *------------------------------------------------------------------------------
 * 2017-12-07, gbo, created
 *******************************************************************************

 *******************************************************************************
 * content
 *------------------------------------------------------------------------------
 *  File            : etpuc_pwm.h
 *  Description     : ETPU输出PWM头文件
 *  Call            : 029-89186510
 ******************************************************************************/
#ifndef _ETPU_FUEL_H_
#define _ETPU_FUEL_H_

/******************************************************************************
 * Include header files
 ******************************************************************************/
#include "etpu_util.h"
#include "etpu_fuel_auto.h"

/******************************************************************************
 * Macros definition
 ******************************************************************************/

/******************************************************************************
 * Types definition
 ******************************************************************************/

/******************************************************************************
 * Functions declaration
 ******************************************************************************/
#if 0
int32_t EtpuFuelInit(uint8_t chn,
                     uint8_t priority,
                     uint8_t cynNum,
                     int32_t startAngle,
                     uint32_t *pInjTimeArr,
                     uint32_t deadAngle,
                     uint32_t exprEdgeAngle,
                     uint32_t anglePerCycle);
#endif
void EtpuFuelSetInjTime(uint8_t chn, uint8_t cynNum, uint32_t *pInjTimeArr);

int32_t EtpuFuelInit2(uint8_t chn,
                     uint8_t priority,
                     uint8_t cynNum,
                     uint8_t railChn,
                     uint32_t *pInjTimeArr,
                     uint32_t railAngle,
                     uint32_t exprEdgeAngle,
                     uint32_t anglePerCycle);
                     
int32_t EtpuRailPressInit(uint8_t chn, uint8_t priority);
int32_t EtpuFuelEnableInit(uint8_t chn, uint8_t priority);

#endif
